# Comparing view and query options
This notebook is to show how sample analytic queries can be run
on different platforms. In particular, it shows different ways for
"view definition" in Spark and PostgreSQL, and how similar queries
perform on top of these views.

# Prerequisites:

Follow the same instructions for [queries_and_views](queries_and_views.ipynb).
The examples below are based on the large dataset of ~80K Patient and ~17M
Observation resources. The SQL-on-FHIR-v2 view generation should also
be enabled with the output going to a PostgreSQL DB. The relevant views
to these experiments are [patient_flat](../docker/config/views/patient_flat_view.json)
and [observation_flat](../docker/config/views/observation_flat_view.json).

# Environment setup
The cell below sets up a SQLAlchemy client for the Thrift server of Spark 
to query Parquet files. In later sections we do the same for PostgreSQL
to query the generated SQL-on-FHIR-v2 materialized views as well.

In [1]:
import pandas

from sqlalchemy import dialects
from sqlalchemy import engine

dialects.registry.register("hive", "pyhive.sqlalchemy_hive", "HiveDialect")

# The endpoint of the Hive ThriftServer to connect to; you may need to
# adjust this if you are not running this through the default docker container.
#query_engine = engine.create_engine("hive://localhost:10001/default")
query_engine = engine.create_engine("hive://spark-thriftserver:10000/default")

The cell below loads the parquet files we've created into our Spark ThriftServer.

**Note 1**: These tables are automatically created if `createHiveResourceTables`
is set to `true` like
[here](https://github.com/google/fhir-data-pipes/blob/3694f1394d0b9011ab480ca61f0bd0568bca2f53/docker/config/application.yaml#L34).

**Note 2**: If you choose to run the following cell and recreate the tables,
you probably need to override `destination_directory_path` to point to the
specific path of the last pipeline run, e.g.,
`/dwh/controller_DWH_TIMESTAMP_2023_09_07T18_11_10_988888411Z`.
The default value below, i.e., `/dwh/controller_*`, assigns _all_ Parquet files
in _all_ of such directories into a _single_ table for each resource.

**Note 3**: The full name of tables have a database name as well which is
`default` but default; so instead of `default.Patient` we simply use `Patient`.

In [2]:
# Please read the note above before recreating resource tables!

destination_directory_path = "/dwh/controller_*"
with query_engine.connect() as con:
    # The following lines are commented out to prevent unintentional deletion.
    # con.execute(f"DROP TABLE IF EXISTS Encounter;")
    # con.execute(f"DROP TABLE IF EXISTS Observation;")
    # con.execute(f"DROP TABLE IF EXISTS Patient;")
    con.execute(
        f"CREATE TABLE IF NOT EXISTS Encounter USING"
        f" PARQUET LOCATION '{destination_directory_path}/Encounter/*.parquet';"
    )
    con.execute(
        f"CREATE TABLE IF NOT EXISTS Observation USING PARQUET"
        f" LOCATION '{destination_directory_path}/Observation/*.parquet';"
    )
    con.execute(
        f"CREATE TABLE IF NOT EXISTS Patient USING PARQUET"
        f" LOCATION '{destination_directory_path}/Patient/*.parquet';"
    )

# Explore the data with SQL
At this point you should be able to run any SQL query against the resource
tables. The following subsections show some sample queries. If you want, you can
skip directly to the [FHIR-vewis section](#FHIR-Views).

In [2]:
pandas.read_sql_query(
    sql=f"SELECT COUNT(*) FROM Patient",
    con=query_engine,
)

   count(1)
0     79370

In [3]:
pandas.read_sql_query(
    sql=(f"SELECT COUNT(*) FROM Observation AS O"),
    con=query_engine,
)

   count(1)
0  16928057

In [4]:
pandas.read_sql_query(
    sql=(f"SELECT COUNT(*) FROM Observation AS O"
      " WHERE O.effective.DateTime > '2010-01-01'"),
    con=query_engine,
)

   count(1)
0   6276279

## Exploring Observation codes
The [SQL-on-FHIR schema](https://github.com/FHIR/sql-on-fhir/blob/master/sql-on-fhir.md)
resembles the JSON structure of FHIR resources and hence has many nested and
repeated structures. It usually makes sense to flatten the columns we need to
deal with. This flattening process varies depending on the SQL dialect.
Here is an example for Observation codes.

_Note_: The actual codes and systems should be ignored as this is for a
synthetic datasets that has not gone through concept mapping.

In [5]:
pandas.read_sql_query(
    sql="""
      SELECT OCC.`system` AS code_sys, OCC.code, OCC.display,
        COUNT(*) AS num_obs, AVG(O.value.quantity.value) AS avg_val
      FROM Observation AS O LATERAL VIEW explode(code.coding) AS OCC
      GROUP BY OCC.`system`, OCC.code, OCC.display
      ORDER BY num_obs DESC
      LIMIT 20; """,
    con=query_engine,
)

,code_sys,code,display,num_obs,avg_val
0,http://loinc.org,1271AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,TESTS ORDERED,4494012,NaN
1,http://loinc.org,1088AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,CURRENT ANTIRETROVIRAL DRUGS USED FOR TREATMENT,2461309,NaN
2,http://loinc.org,1111AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,PATIENT REPORTED CURRENT TB TREATMENT,2134278,NaN
3,http://loinc.org,1250AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,ANTIRETROVIRALS STARTED,1860021,NaN
4,http://loinc.org,1270AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,TUBERCULOSIS TREATMENT STARTED,1180593,NaN
5,http://loinc.org,159800AAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,REVIEW OF TUBERCULOSIS SCREENING QUESTIONS,653079,NaN
6,http://loinc.org,5085AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,LOINC Code,480564,162.476288
7,http://loinc.org,159911AAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,PATIENT REPORTED CURRENT ANTIRETROVIRAL TREATMENT,442435,NaN
8,http://loinc.org,1261AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,PCP PROPHYLAXIS PLAN,352996,NaN
9,http://loinc.org,1265AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,TUBERCULOSIS PROPHYLAXIS PLAN,352996,NaN
10,http://loinc.org,1255AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,ANTIRETROVIRAL PLAN,352996,NaN
11,http://loinc.org,1268AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,TUBERCULOSIS TREATMENT PLAN,352996,NaN
12,http://loinc.org,1040AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,"HIV RAPID TEST, QUALITATIVE",240282,NaN
13,http://loinc.org,5088AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,TEMPERATURE,240282,36.996701
14,http://loinc.org,5092AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,BLOOD OXYGEN SATURATION,240282,84.491207
15,http://loinc.org,5087AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,PULSE,240282,125.140286
16,http://loinc.org,1030AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,"HIV DNA POLYMERASE CHAIN REACTION, QUALITATIVE",240282,NaN
17,http://loinc.org,856AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,HIV viral load,240282,500578.760178
18,http://loinc.org,5096AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,Return visit date,209350,NaN
19,http://loinc.org,5089AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,Weight,79370,63.996196

## Indicator example
The following query counts number of patients that have had an observation
with a specific code (HIV viral load), with a value below a certain threshold
(400000), during a specific reporting period (year 2010 in this example).
This is a useful pattern in many cases, e.g., calculating TX_CURR or TX_PVLS
indicators of [PEPFAR](https://www.state.gov/pepfar-fy-2023-mer-indicators/)
(for TX_CURR we need to look at `O.value.codeableConcept.coding`).

In [6]:
pandas.read_sql_query(
    sql="""
      SELECT COUNT(DISTINCT O.subject.PatientId) AS num_patients
      FROM Observation AS O LATERAL VIEW explode(code.coding) AS OCC
      WHERE OCC.code LIKE '856%%'
        AND OCC.`system` = 'http://loinc.org'
        AND O.value.quantity.value < 400000
        AND YEAR(O.effective.dateTime) = 2010
    ;
    """,
    con=query_engine,
)

   num_patients
0          3074

We can repeat the same query against the [`Observation_flat`](../docker/config/views/Observation_flat.sql)
view which is created by default if `createHiveResourceTables` is enabled (note this is slower since
`Observation_flat` has a more complex structure than above).

In [7]:
pandas.read_sql_query(
    sql="SELECT * FROM Observation_flat LIMIT 5;",
    con=query_engine,
)

,id,patient_id,encounter_id,status,code,code_sys,val_quantity,val_code,val_sys,obs_date,category_sys,category_code
0,19039341,19038597,19039309,final,1088AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,http://loinc.org,NaN,84309AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,http://snomed.info/sct,1967-08-08T17:38:44+00:00,http://terminology.hl7.org/CodeSystem/observat...,survey
1,19039363,19038597,19039362,final,5088AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,http://loinc.org,35.359,None,None,1969-07-29T17:38:44+00:00,http://terminology.hl7.org/CodeSystem/observat...,survey
2,19039365,19038597,19039362,final,5085AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,http://loinc.org,157.340,None,None,1969-07-29T17:38:44+00:00,http://terminology.hl7.org/CodeSystem/observat...,survey
3,19039385,19038597,19039362,final,1271AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,http://loinc.org,NaN,302AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,http://snomed.info/sct,1969-07-29T17:38:44+00:00,http://terminology.hl7.org/CodeSystem/observat...,survey
4,19039872,19039490,19039865,final,159800AAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,http://loinc.org,NaN,138905AAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,http://snomed.info/sct,2015-08-30T14:28:42+00:00,http://terminology.hl7.org/CodeSystem/observat...,survey

In [8]:
pandas.read_sql_query(
    sql="""SELECT COUNT(DISTINCT patient_id) AS num_patients
      FROM Observation_flat
      WHERE code LIKE '856%%'
        AND code_sys = 'http://loinc.org'
        AND val_quantity < 400000
        AND YEAR(obs_date) = 2010
      LIMIT 100; """,
    con=query_engine,
)

   num_patients
0          3074

### Grouping by year and gender
This is just for an example of how a real indicator like `TX_PVLS` of PEPFAR can
be calculated. First we look at some sample rows then we do a `JOIN` with patients.

In [9]:
pandas.read_sql_query(
    sql="""
      SELECT patient_id, YEAR(obs_date) AS obs_year,
        COUNT(*) AS num_obs
      FROM Observation_flat
      WHERE code LIKE '856%%'
        AND code_sys = 'http://loinc.org'
        AND val_quantity < 400000
      GROUP BY patient_id, obs_year
      LIMIT 10
    ;
    """,
    con=query_engine,
)

  patient_id  obs_year  num_obs
0   20849349      1992        1
1   22326496      2006        1
2    2417444      1977        1
3   24471405      2003        1
4     250519      1976        1
5   25563320      2015        1
6   26179114      1989        1
7   26585690      2015        1
8    2786235      2017        1
9   20793801      2017        1

In [10]:
pandas.read_sql_query(
    sql="SELECT * FROM Patient_flat LIMIT 5;",
    con=query_engine,
)

,id,active,family,given,gender,deceased,age,country,practitioner_id,organization_id
0,10032875,None,VonRueden376,Burt293,male,None,35,US,None,None
1,10048468,None,Schroeder447,Bulah832,female,None,41,US,None,None
2,10048468,None,Cartwright189,Bulah832,female,None,41,US,None,None
3,10051843,None,Koch169,Manual570,male,None,71,US,None,None
4,10053265,None,Upton904,Palma671,female,None,79,US,None,None

In [11]:
pandas.read_sql_query(
    sql="""SELECT P.gender, obs_year, COUNT(*) FROM
      (
        SELECT patient_id, YEAR(obs_date) AS obs_year,
          COUNT(*) AS num_obs
        FROM Observation_flat
        WHERE code LIKE '856%%'
          AND code_sys = 'http://loinc.org'
          AND val_quantity < 400000
        GROUP BY patient_id, obs_year
      ) AS O, Patient_flat AS P
      WHERE O.patient_id = P.id
      GROUP BY P.gender, obs_year
      ORDER BY obs_year, gender
    ;
    """,
    con=query_engine,
)

     gender  obs_year  count(1)
0      male      1928         2
1    female      1929         2
2      male      1929         1
3    female      1930         2
4      male      1930         2
..      ...       ...       ...
182    male      2019      1375
183  female      2020      1538
184    male      2020      1018
185  female      2021       180
186    male      2021       125

[187 rows x 3 columns]

# Views in PostgreSQL
This section is to repeat the same indicator calculation using the SQL-on-FHIR-v2 views created in PostgreSQL.
These views are defined in `docker/config/views/*_view.json` files. Note the views are created and materialized
in a PostgreSQL database while running the pipeline; so the following queries do not need to deal with
SQL-on-FHIR-v1 schema complexities.

In [12]:
pg_query_engine = engine.create_engine("postgresql+psycopg2://admin:admin@hapi-fhir-db-large:5432/views")

In [13]:
pandas.read_sql_query(
    sql="SELECT * FROM observation_flat LIMIT 5;",
    con=pg_query_engine,
)

,id,patient_id,encounter_id,status,obs_date,val_quantity,code,code_sys,val_code,val_sys
0,10000011,9999609,9999994,final,2014-03-26 11:37:06+00:00,None,1271AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,http://loinc.org,None,None
1,10000172,9999609,10000141,final,2015-11-03 11:37:06+00:00,None,1250AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,http://loinc.org,None,None
2,10000020,9999609,9999994,final,2014-03-26 11:37:06+00:00,None,1271AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,http://loinc.org,None,None
3,10000048,9999609,9999994,final,2014-03-26 11:37:06+00:00,None,1250AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,http://loinc.org,None,None
4,10000220,9999609,10000207,final,2017-07-31 11:37:06+00:00,None,1271AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA,http://loinc.org,None,None

In [14]:
pandas.read_sql_query(
    sql="""SELECT COUNT(DISTINCT patient_id) AS num_patients
      FROM observation_flat
      WHERE code LIKE '856%%'
        AND code_sys = 'http://loinc.org'
        AND val_quantity < 400000
        AND EXTRACT(YEAR from obs_date) = 2010
      LIMIT 100; """,
    con=pg_query_engine,
)

   num_patients
0          3074

In [15]:
pandas.read_sql_query(
    sql="""
      SELECT patient_id, EXTRACT(YEAR from obs_date) AS obs_year,
        COUNT(*) AS num_obs
      FROM observation_flat
      WHERE code LIKE '856%%'
        AND code_sys = 'http://loinc.org'
        AND val_quantity < 400000
      GROUP BY patient_id, obs_year
      LIMIT 10
    ;
    """,
    con=pg_query_engine,
)

  patient_id  obs_year  num_obs
0   10000330    1984.0        1
1    1000214    2014.0        1
2   10002988    2013.0        1
3   10002988    2014.0        1
4   10003281    2002.0        1
5   10003281    2005.0        1
6   10003281    2006.0        1
7   10004066    2010.0        1
8   10005208    2015.0        1
9   10006087    2019.0        1

In [16]:
pandas.read_sql_query(
    sql="SELECT * FROM patient_flat LIMIT 5;",
    con=pg_query_engine,
)

,id,active,gender,deceased,organization_id,practitioner_id,family,given
0,10007135,None,male,None,,None,Lowe577,Quentin28
1,10030109,None,male,None,,None,Raya927,Gabriel934
2,10029335,None,female,None,,None,Runolfsson901,Cheri871
3,10139210,None,female,None,,None,Pacocha935,Nola814
4,10131589,None,female,None,,None,Mosciski958,Keitha498

In [17]:
pandas.read_sql_query(
    sql="""SELECT P.gender, obs_year, COUNT(*) FROM
      (
        SELECT patient_id, EXTRACT(YEAR from obs_date) AS obs_year,
          COUNT(*) AS num_obs
        FROM observation_flat
        WHERE code LIKE '856%%'
          AND code_sys = 'http://loinc.org'
          AND val_quantity < 400000
        GROUP BY patient_id, obs_year
      ) AS O, patient_flat AS P
      WHERE O.patient_id = P.id
      GROUP BY P.gender, obs_year
      ORDER BY obs_year, gender
    ; """,
    con=pg_query_engine,
)

     gender  obs_year  count
0      male    1928.0      2
1    female    1929.0      2
2      male    1929.0      1
3    female    1930.0      2
4      male    1930.0      2
..      ...       ...    ...
182    male    2019.0   1375
183  female    2020.0   1538
184    male    2020.0   1018
185  female    2021.0    180
186    male    2021.0    125

[187 rows x 3 columns]

## A note on execution times
As it can be seen in the execution time information of the cells above, doing
similar queries can be 2 to 5 times faster on PostgreSQL e.g. (numbers are
from running on a machine with 48 cores, ~200 GB memory, and an SSD):
- 0.9 vs 4.5 seconds for "distinct patients with suppressed viral load" query
- 1.1 vs 2.2 seconds for "patients with suppressed viral load grouped by
  year and gender" query.

Of course more data on various queries need to be gathered to make any
conclusions but a few points to note:
- The PostgreSQL views are materialized, i.e., conversion of FHIR resources
  to view rows are already done. This has obvious performance benefits compared
  to the Parquet files with SQL-on-FHIR-v1 schema, including the total IO
  needed to run the query.
- One important motivation for using Parquet files with a distributed query
  engine (like Spark) is to be able to horizontally scale these queries which
  is not doable with PostgreSQL.
- The SQL-on-FHIR-v1 schema contains [almost] all information in the original
  FHIR resources, while SQL-on-FHIR-v2 views are purpose built. IOW, if some
  fields in the original FHIR resources are missing in the materialized view,
  then new views need to be generated from the original FHIR resources.